Revit 2024 API
LightShape Methods
The LightShape type exposes the following members.
Methods
Name | Description
Clone
 Creates a copy of the LightShape derived object.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
LightShape Class
Autodesk.Revit.DB.Lighting Namespace